SubModel/CFDEMInterFoamIB-main/tutorial/multi_sphere_fish/CFD/0/s
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      s;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    "(x1|walls|x2)"
    {
        type            zeroGradient;
    }


    z2
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

}

// ************************************************************************* //
